Tekla Open API Reference for Tekla Structures 2025
ModificationInfo.ModifiedWithInfo Field
 The modified objects with information of modification type. Objects which have only attribute (UDA) changed, and/or which has been numbered since last take are included.
 Namespace: Tekla.Structures.Model.History
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public IEnumerable<ModifiedObjectInfo> ModifiedWithInfo
Public ModifiedWithInfo As IEnumerable(Of ModifiedObjectInfo)
Field Value
Type: IEnumerable<ModifiedObjectInfo>
See Also
Reference
ModificationInfo Structure
Tekla.Structures.Model.History Namespace